[
    {
        "title": "Dunkirk",
        "year": "2017",
        "overview": "May/June 1940. Four hundred thousand British and French soldiers are hole up in the French port town of Dunkirk. The only way out is via sea, and the Germans have air superiority, bombing the British soldiers and ships without much opposition. The situation looks dire and, in desperation, Britain sends civilian boats in addition to its hard-pressed Navy to try to evacuate the beleaguered forces. This is that story, seen through the eyes of a soldier amongst those trapped forces, two Royal Air Force fighter pilots, and a group of civilians on their boat, part of the evacuation fleet.",
        "release_date": "21 Jul 2017",
        "runtime": "106 min",
        "genre": "Action, Drama, History",
        "director": "Christopher Nolan",
        "actors": "Fionn Whitehead, Barry Keoghan, Mark Rylance",
        "rating": "7.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZWU5ZjJkNTQtMzQwOS00ZGE4LWJkMWUtMGQ5YjdiM2FhYmRhXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christopher Nolan"
    },
    {
        "title": "Following",
        "year": "1998",
        "overview": "An older man listens to Bill's story about being a callow writer who likes to follow strangers around London, observing them. One day, a glib and self-confident man whom Bill has been following confronts him. He's Cobb, a burglar who takes Bill under his wing and shows him how to break and enter. They burgle a woman's flat; Bill gets intrigued with her (photographs are everywhere in her flat). He follows her and chats her up at a bar owned by her ex-boyfriend, a nasty piece of work who killed someone in her living room with a hammer. Soon Bill is volunteering to do her a favor, which involves a break-in. What does the older man know that Bill doesn't?",
        "release_date": "05 Nov 1999",
        "runtime": "69 min",
        "genre": "Crime, Mystery, Thriller",
        "director": "Christopher Nolan",
        "actors": "Jeremy Theobald, Alex Haw, Lucy Russell",
        "rating": "7.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNjZiMTI5OGItZWJhMC00OGRiLTk1NzAtYmNmZTM0MzFmNGM0XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christopher Nolan"
    },
    {
        "title": "Inception",
        "year": "2010",
        "overview": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible, inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea, but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.",
        "release_date": "16 Jul 2010",
        "runtime": "148 min",
        "genre": "Action, Adventure, Sci-Fi",
        "director": "Christopher Nolan",
        "actors": "Leonardo DiCaprio, Joseph Gordon-Levitt, Elliot Page",
        "rating": "8.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_SX300.jpg",
        "category": "Christopher Nolan"
    },
    {
        "title": "Insomnia",
        "year": "2002",
        "overview": "In Nightmute, Alaska, seventeen year old resident Kay Connell is found murdered. As a favor to the local Nightmute police chief, two Los Angeles Robbery Homicide police detectives, Will Dormer and Hap Eckhart, are called in to assist in the investigation. Although renowned in the police world, both Dormer and Eckhart are facing some professional issues back in Los Angeles. In Nightmute, Dormer has a major case of insomnia due to a combination of the incessant midnight sun and from a secret he is carrying. This insomnia is causing him to be delusional. Something he is not dreaming about is that the murderer has contacted him, informing him all about the murder and the fact that he knows everything that is going on with Dormer. They begin a symbiotic relationship in keeping secrets for each individual's benefit. But ambitious young local detective, Ellie Burr, might piece the story together on her own.",
        "release_date": "24 May 2002",
        "runtime": "118 min",
        "genre": "Drama, Mystery, Thriller",
        "director": "Christopher Nolan",
        "actors": "Al Pacino, Robin Williams, Hilary Swank",
        "rating": "7.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BOWUyMTY3MzUtODBiZC00ZjRmLTlkYTMtNDYyODNhODcyOTNlXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christopher Nolan"
    },
    {
        "title": "Interstellar",
        "year": "2014",
        "overview": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.",
        "release_date": "07 Nov 2014",
        "runtime": "169 min",
        "genre": "Adventure, Drama, Sci-Fi",
        "director": "Christopher Nolan",
        "actors": "Matthew McConaughey, Anne Hathaway, Jessica Chastain",
        "rating": "8.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYzdjMDAxZGItMjI2My00ODA1LTlkNzItOWFjMDU5ZDJlYWY3XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christopher Nolan"
    },
    {
        "title": "Memento",
        "year": "2000",
        "overview": "Memento chronicles two separate stories of Leonard, an ex-insurance investigator who can no longer build new memories, as he attempts to find the murderer of his wife, which is the last thing he remembers. One story line moves forward in time while the other tells the story backwards revealing more each time.",
        "release_date": "25 May 2001",
        "runtime": "113 min",
        "genre": "Drama, Mystery, Thriller",
        "director": "Christopher Nolan",
        "actors": "Guy Pearce, Carrie-Anne Moss, Joe Pantoliano",
        "rating": "8.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYmQ3MjliNjAtNWFiZS00YWI1LTlmZTktMzBiNDE1NjRhZjU0XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christopher Nolan"
    },
    {
        "title": "Oppenheimer",
        "year": "2023",
        "overview": "A dramatization of the life story of J. Robert Oppenheimer, the physicist who had a large hand in the development of the atomic bombs that brought an end to World War II.",
        "release_date": "21 Jul 2023",
        "runtime": "180 min",
        "genre": "Biography, Drama, History",
        "director": "Christopher Nolan",
        "actors": "Cillian Murphy, Emily Blunt, Matt Damon",
        "rating": "8.3",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BN2JkMDc5MGQtZjg3YS00NmFiLWIyZmQtZTJmNTM5MjVmYTQ4XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christopher Nolan"
    },
    {
        "title": "Tenet",
        "year": "2020",
        "overview": "In a twilight world of international espionage, an unnamed CIA operative, known as The Protagonist, is recruited by a mysterious organization called Tenet to participate in a global assignment that unfolds beyond real time. The mission: prevent Andrei Sator, a renegade Russian oligarch with precognition abilities, from starting World War III. The Protagonist will soon master the art of \"time inversion\" as a way of countering the threat that is to come.",
        "release_date": "03 Sep 2020",
        "runtime": "150 min",
        "genre": "Action, Sci-Fi, Thriller",
        "director": "Christopher Nolan",
        "actors": "John David Washington, Robert Pattinson, Elizabeth Debicki",
        "rating": "7.3",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTU0ZjZlYTUtYzIwMC00ZmQzLWEwZTAtZWFhMWIwYjMxY2I3XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christopher Nolan"
    },
    {
        "title": "The Prestige",
        "year": "2006",
        "overview": "In the end of the nineteenth century, in London, Robert Angier, his beloved wife Julia McCullough, and Alfred Borden are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death, and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences.",
        "release_date": "20 Oct 2006",
        "runtime": "130 min",
        "genre": "Drama, Mystery, Sci-Fi",
        "director": "Christopher Nolan",
        "actors": "Christian Bale, Hugh Jackman, Scarlett Johansson",
        "rating": "8.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTM3MzQ5MjQ5OF5BMl5BanBnXkFtZTcwMTQ3NzMzMw@@._V1_SX300.jpg",
        "category": "Christopher Nolan"
    },
    {
        "title": "Batman Begins",
        "year": "2005",
        "overview": "When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia, where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as \"Batman\". But it doesn't stay quiet for long.",
        "release_date": "15 Jun 2005",
        "runtime": "140 min",
        "genre": "Action, Crime, Drama",
        "director": "Christopher Nolan",
        "actors": "Christian Bale, Michael Caine, Ken Watanabe",
        "rating": "8.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BODIyMDdhNTgtNDlmOC00MjUxLWE2NDItODA5MTdkNzY3ZTdhXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "The Batman Triology"
    },
    {
        "title": "The Dark Knight Rises",
        "year": "2012",
        "overview": "Despite his tarnished reputation after the events of The Dark Knight (2008), in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its Police force, which is struggling to cope with Bane's plans to destroy the city.",
        "release_date": "20 Jul 2012",
        "runtime": "164 min",
        "genre": "Action, Crime, Drama",
        "director": "Christopher Nolan",
        "actors": "Christian Bale, Tom Hardy, Anne Hathaway",
        "rating": "8.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTk4ODQzNDY3Ml5BMl5BanBnXkFtZTcwODA0NTM4Nw@@._V1_SX300.jpg",
        "category": "The Batman Triology"
    },
    {
        "title": "The Dark Knight",
        "year": "2008",
        "overview": "Set within a year after the events of Batman Begins (2005), Batman, Lieutenant James Gordon, and new District Attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City, until a mysterious and sadistic criminal mastermind known only as \"The Joker\" appears in Gotham, creating a new wave of chaos. Batman's struggle against The Joker becomes deeply personal, forcing him to \"confront everything he believes\" and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent, and Rachel Dawes.",
        "release_date": "18 Jul 2008",
        "runtime": "152 min",
        "genre": "Action, Crime, Drama",
        "director": "Christopher Nolan",
        "actors": "Christian Bale, Heath Ledger, Aaron Eckhart",
        "rating": "9.0",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_SX300.jpg",
        "category": "The Batman Triology"
    },
    {
        "title": "Anatomy of a Fall",
        "year": "2023",
        "overview": "A woman is suspected of murder after her husband's death; their half-blind son faces a moral dilemma as the main witness.",
        "release_date": "22 Mar 2024",
        "runtime": "151 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Justine Triet",
        "actors": "Sandra Hüller, Swann Arlaud, Milo Machado-Graner",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYTk3MjFkZmQtMThiYi00N2JhLTk2YzItZTE5ZGUxZTIyZDVkXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "Bridge of Spies",
        "year": "2015",
        "overview": "In the cold war, a lawyer, James B. Donovan is recruited by the CIA and involved in an intense negotiation mission to release and exchange a CIA U-2 spy-plane pilot, Francis G. Powers. The pilot was arrested alive after his plane was shot down by the Soviet Union during a mission and stays in the company of a KGB intelligence officer, Rudolf Abel, who was arrested for espionage in the US.",
        "release_date": "16 Oct 2015",
        "runtime": "142 min",
        "genre": "Drama, History, Thriller",
        "director": "Steven Spielberg",
        "actors": "Tom Hanks, Mark Rylance, Alan Alda",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjIxOTI0MjU5NV5BMl5BanBnXkFtZTgwNzM4OTk4NTE@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "Dark Waters",
        "year": "2019",
        "overview": "A corporate defense attorney takes on an environmental lawsuit against a chemical company that exposes a lengthy history of pollution.",
        "release_date": "06 Dec 2019",
        "runtime": "126 min",
        "genre": "Biography, Drama, History",
        "director": "Todd Haynes",
        "actors": "Mark Ruffalo, Anne Hathaway, Tim Robbins",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNmQzM2M4MTEtZjM3Yy00Njk1LWJmNjQtYzg4YjVmZmZkZDA0XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "Erin Brockovich",
        "year": "2000",
        "overview": "Erin Brockovich-Ellis is an unemployed single mother, desperate to find a job, but is having no luck. This losing streak even extends to a failed lawsuit against a doctor in a car accident she was in. With no alternative, she successfully browbeats her lawyer to give her a job in compensation for the loss. While no one takes her seriously, with her trashy clothes and earthy manners, that soon changes when she begins to investigate a suspicious real estate case involving the Pacific Gas &amp; Electric Company. What she discovers is that the company is trying quietly to buy land that was contaminated by hexavalent chromium, a deadly toxic waste that the company is improperly and illegally dumping and, in turn, poisoning the residents in the area. As she digs deeper, Erin finds herself leading point in a series of events that would involve her law firm in one of the biggest class action lawsuits in American history against a multi-billion dollar corporation.",
        "release_date": "17 Mar 2000",
        "runtime": "131 min",
        "genre": "Biography, Drama",
        "director": "Steven Soderbergh",
        "actors": "Julia Roberts, Albert Finney, David Brisbin",
        "rating": "7.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZTNkNzkzYTEtYTJkMC00MTNkLWE0YjMtOGYxNGI0ODNiMzIwXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "Fracture",
        "year": "2007",
        "overview": "Wealthy, brilliant, and meticulous Ted Crawford, a structural engineer in Los Angeles, shoots his wife Jennifer and entraps her lover, Lieutenant Robert \"Rob\" Nunally. He signs a confession. At the arraignment, he asserts his rights to represent himself and asks the court to move immediately to trial. The prosecutor is Willy Beachum, a hotshot who's soon to join a fancy civil-law firm, told by everyone it's an open and shut case. Crawford sees Beachum's weakness, the hairline fracture of his character: Willy's a winner. The engineer sets in motion a clockwork crime with all of the objects moving in ways he predicts.",
        "release_date": "20 Apr 2007",
        "runtime": "113 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Gregory Hoblit",
        "actors": "Anthony Hopkins, Ryan Gosling, David Strathairn",
        "rating": "7.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMzIzNjQyMzkwM15BMl5BanBnXkFtZTcwOTg5ODQ0MQ@@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "Marshall",
        "year": "2017",
        "overview": "In 1940, Thurgood Marshall is a young lawyer for the NAACP who criss-crosses the country defending innocent African-Americans from unjust indictments in court. His latest case is in Bridgeport, Connecticut where an African-American chauffeur is accused of rape of a wealthy white society woman. To admit Marshall into the local Bar, insurance lawyer Sam Friedman is picked over his objections to do introductions in court. However, Friedman's commitment changes drastically when the racist judge forbids Marshall to speak in court, forcing Friedman to act as lead counsel. Now in an intolerable situation for the pair, Marshall must guide his new compatriot through this criminal trial even as Friedman endures not only this unfamiliar area of law, but also the bigoted pressure he now must share. However, the case proves more complex than either anticipates with unexpected twists and turns even as it becomes a vital one that would define two careers as well as the fight for justice in America.",
        "release_date": "13 Oct 2017",
        "runtime": "118 min",
        "genre": "Biography, Crime, Drama",
        "director": "Reginald Hudlin",
        "actors": "Chadwick Boseman, Josh Gad, Kate Hudson",
        "rating": "7.3",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNTRmOTMyNWYtNTg2NS00MTcwLThkOTAtN2YyZmUzZjIxODdhXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "Michael Clayton",
        "year": "2007",
        "overview": "Michael Clayton, a high-priced law firm's fixer, leaves a late night poker game, gets a call to drive to Westchester, and watches his car blow up as he's taking an impromptu dawn walk through a field. Flash back four days. He owes a loan shark to cover his brother's debts (Michael's own gambling habits have left him virtually broke). His law firm is negotiating a high-stakes merger, and his firm's six year defense of a conglomerate's pesticide use is at risk when one of the firm's top litigators goes off his meds and puts the case in jeopardy. While Michael is trying to fix things someone decides to kill him. Who? Meanwhile his son summarizes the plot of a dark fantasy novel.",
        "release_date": "12 Oct 2007",
        "runtime": "119 min",
        "genre": "Crime, Drama, Mystery",
        "director": "Tony Gilroy",
        "actors": "George Clooney, Tilda Swinton, Tom Wilkinson",
        "rating": "7.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTc0NTU5MjI2MV5BMl5BanBnXkFtZTcwMTg5NTQzMw@@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "Runaway Jury",
        "year": "2003",
        "overview": "Wendell Rohr is a torts lawyer taking on the gun lobby. Rankin Fitch is the jury consultant for the Defendants and between them the battle is for the hearts and minds of the jury. But there is someone on the inside. Nicholas Easter is a juror with a girlfriend, Marlee, on the outside. they have a past ..... and their own agenda.",
        "release_date": "17 Oct 2003",
        "runtime": "127 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Gary Fleder",
        "actors": "John Cusack, Rachel Weisz, Gene Hackman",
        "rating": "7.1",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BOWZkZGFhZDAtNzBmYy00Mjk1LWFjYjQtYzVhMzhiNzQ0MTRlXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "The Instigators",
        "year": "2024",
        "overview": "Follows two robbers who must go on the run with the help of one of their therapists after a theft doesn't go as planned.",
        "release_date": "09 Aug 2024",
        "runtime": "101 min",
        "genre": "Action, Comedy, Crime",
        "director": "Doug Liman",
        "actors": "Matt Damon, Casey Affleck, Hong Chau",
        "rating": "6.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYTExNzBhOTAtOGIyYy00MzY5LWFjOWYtZDE2NDE0ZmI3Y2Q3XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "The Trial of the Chicago 7",
        "year": "2020",
        "overview": "In Chicago 1968, the Democratic Party Convention was met with protests from activists like the moderate Students for a Democratic Society led by Tom Hayden and the militant Yippies led by Abbie Hoffman and Jerry Rubin, which led to violent confrontations with the local authorities. As a result, seven of the accused ringleaders are arraigned on charges like Conspiracy by the hostile Nixon administration, including Bobby Seale of the Black Panthers who was not involved in the incident. What follows is an unfair trial presided by the belligerent Judge Hoffman (No relation) and prosecuted by a reluctant but duty-bound Richard Schultz. As their pro bono lawyers face such odds, Hayden and his fellows are frustrated by the Yippies' outrageous antics undermining their defense in defiance of the system even while Seale is denied a chance to defend himself his way. Along the way, the Chicago 7 clash in their political philosophies even as they learn they need each other in this fight.",
        "release_date": "16 Oct 2020",
        "runtime": "129 min",
        "genre": "Drama, History, Thriller",
        "director": "Aaron Sorkin",
        "actors": "Eddie Redmayne, Alex Sharp, Sacha Baron Cohen",
        "rating": "7.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZjY2ZGFlOTgtOGQ1MS00YWJhLWIyZjQtNWNmNTQ0YTk0MTZjXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Courtroom Drama"
    },
    {
        "title": "Black Bag",
        "year": "2025",
        "overview": "When intelligence agent Kathryn Woodhouse is suspected of betraying the nation, her husband - also a legendary agent - faces the ultimate test of whether to be loyal to his marriage, or his country.",
        "release_date": "14 Mar 2025",
        "runtime": "93 min",
        "genre": "Drama, Mystery, Romance",
        "director": "Steven Soderbergh",
        "actors": "Michael Fassbender, Gustaf Skarsgård, Cate Blanchett",
        "rating": "6.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNzA1OWU4NDMtMDUxMC00NWI4LWJhYjUtYWQ0OGQ5MTc2NDRjXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Collateral",
        "year": "2004",
        "overview": "This action thriller follows LA cabbie Max Durocher, the type of person who can wax poetic about other people's lives, which impresses U.S. Justice Department prosecutor Annie Farrell, one of his fares, so much that she gives him her telephone number at the end of her ride. Although a dedicated man as seen through the efficiency in which he does his work, he can't or won't translate that eloquence into a better life for himself. He deludes himself into believing that his now twelve year cabbie job is temporary and that someday he will own his own limousine service. He even lies to his hospitalized mother that he already owns one, with a further lie that he tells her as such primarily to make her happy, rather than the truth which is that he won't do anything to achieve that dream. One night, Max picks up a well dressed man named Vincent, who asks Max to be his only fare for the evening. For a flat fee of $600, plus an extra $100 if he gets to the airport on time - Vincent wants Max to drive him to five stops that evening. Max somewhat reluctantly agrees. Max learns the hard way at their first stop when a body falls from a third story apartment window and lands dead on top of his cab that Vincent is a contract hit man. Vincent's main goal, as per his current contract, is to kill five people, one at each of the stops, but he will not let others get in the way of that goal, even if it means killing them, including Max. As Vincent forces Max to continue driving him for the evening, Max tries slyly at every turn to take back control of his life from Vincent, especially when Max learns of one of the names on Vincent's hit list. Meanwhile, LAPD narcotics detective, Ray Fanning, and ultimately the FBI get involved when Vincent's first victim is associated with a case in which Ray is working undercover. Ray is able to piece together information which makes him hot on Max and Vincent's tail.",
        "release_date": "06 Aug 2004",
        "runtime": "120 min",
        "genre": "Action, Crime, Drama",
        "director": "Michael Mann",
        "actors": "Tom Cruise, Jamie Foxx, Jada Pinkett Smith",
        "rating": "7.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjE3NjM5OTMxMV5BMl5BanBnXkFtZTcwOTIzMTQyMw@@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Conclave",
        "year": "2024",
        "overview": "When Cardinal Lawrence is tasked with leading one of the world's most secretive and ancient events, selecting a new Pope, he finds himself at the center of a web of conspiracies and intrigue that could shake the very foundation of...",
        "release_date": "25 Oct 2024",
        "runtime": "120 min",
        "genre": "Drama, Thriller",
        "director": "Edward Berger",
        "actors": "Ralph Fiennes, Stanley Tucci, John Lithgow",
        "rating": "7.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYjgxMDI5NmMtNTU3OS00ZDQxLTgxZmEtNzY1ZTBmMDY4NDRkXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Drive",
        "year": "2011",
        "overview": "This action drama follows a mysterious man who has multiple jobs as a garage mechanic, a Hollywood stuntman and a getaway driver seems to be trying to escape his shady past as he falls for his neighbor - whose husband is in prison and who's looking after her child alone. Meanwhile, his garage mechanic boss is trying to set up a race team using gangland money, which implicates our driver as he is to be used as the race team's main driver. Our hero gets more than he bargained for when he meets the man who is married to the woman he loves.",
        "release_date": "16 Sep 2011",
        "runtime": "100 min",
        "genre": "Action, Drama",
        "director": "Nicolas Winding Refn",
        "actors": "Ryan Gosling, Carey Mulligan, Bryan Cranston",
        "rating": "7.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYTFmNTFlOTAtNzEyNi00MWU2LTg3MGEtYjA2NWY3MDliNjlkXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Flight Risk",
        "year": "2025",
        "overview": "A pilot transports an Air Marshal accompanying a fugitive to trial. As they cross the Alaskan wilderness, tensions soar and trust is tested, as not everyone on board is who they seem.",
        "release_date": "24 Jan 2025",
        "runtime": "91 min",
        "genre": "Action, Crime, Drama",
        "director": "Mel Gibson",
        "actors": "Michelle Dockery, Mark Wahlberg, Topher Grace",
        "rating": "5.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BOGZlZjAyYTItMDdjYy00OGZlLWI3NDAtYzM5ZjAwNjg0NWUxXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Hell or High Water",
        "year": "2016",
        "overview": "In Texas, after the death of his mother, the unemployed oil and gas worker Toby Howard is losing his ranch to the Texas Midlands Bank. Toby is divorced from his wife who lives with their two sons. When his brother Tanner Howard is released from the prison, they team up to rob agencies of the Texas Midlands Bank to raise money to pay the loan so that Toby may leave the real estate to his sons. Meanwhile the Texas Ranger Marcus Hamilton who is near retirement and his Native American-descendant partner Alberto Parker try to anticipate the next move of the thieves.",
        "release_date": "26 Aug 2016",
        "runtime": "102 min",
        "genre": "Crime, Drama, Thriller",
        "director": "David Mackenzie",
        "actors": "Chris Pine, Ben Foster, Jeff Bridges",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTg4NDA1OTA5NF5BMl5BanBnXkFtZTgwMDQ2MDM5ODE@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Kiss Kiss Bang Bang",
        "year": "2005",
        "overview": "A petty thief posing as an actor is brought to Los Angeles for an unlikely audition and finds himself in the middle of a murder investigation along with his high school dream girl and a detective who's been training him for his upcoming role...",
        "release_date": "11 Nov 2005",
        "runtime": "103 min",
        "genre": "Comedy, Crime, Mystery",
        "director": "Shane Black",
        "actors": "Robert Downey Jr., Val Kilmer, Michelle Monaghan",
        "rating": "7.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTY5NDExMDA3M15BMl5BanBnXkFtZTYwNTc2MzA3._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Knives Out",
        "year": "2019",
        "overview": "When renowned crime novelist Harlan Thrombey (Christopher Plummer) is found dead at his estate just after his 85th birthday, the inquisitive and debonair Detective Benoit Blanc (Daniel Craig) is mysteriously enlisted to investigate. From Harlan's disfunctional family to his devoted staff, Blanc sifts through a web of red herrings and self-serving lies to uncover the truth behind Harlan's untimely death.",
        "release_date": "27 Nov 2019",
        "runtime": "130 min",
        "genre": "Comedy, Crime, Drama",
        "director": "Rian Johnson",
        "actors": "Daniel Craig, Chris Evans, Ana de Armas",
        "rating": "7.9",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZDU5ZTRkYmItZjg0Mi00ZTQwLThjMWItNWM3MTMxMzVjZmVjXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Last Breath",
        "year": "2025",
        "overview": "A true story that follows seasoned deep-sea divers as they battle the raging elements to rescue their crew mate trapped hundreds of feet below the ocean's surface.",
        "release_date": "28 Feb 2025",
        "runtime": "93 min",
        "genre": "Drama, Thriller",
        "director": "Alex Parkinson",
        "actors": "Woody Harrelson, Simu Liu, Finn Cole",
        "rating": "6.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYmNjMDg1Y2EtNmZiOS00NGUzLThjZGYtNzU2OGI5M2VkMDFhXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Mystic River",
        "year": "2003",
        "overview": "In the summer of 1975 in a neighborhood in Boston, three kids- Dave Boyle and his two friends, Jimmy Markum and Sean Devine- are playing on the sidewalk when Dave gets abducted by two men and endures days of sexual abuse. Eventually Dave escapes, but is traumatized throughout adulthood. Jimmy is an ex-con and a father of three, whose daughter Katie is found dead, and Dave becomes the number one suspect. Sean is a homicide detective investigating Katie's murder, and finds himself faced with past and present demons as more is uncovered about Katie's murder. Learning Katie had a boyfriend, ballistics later connect a gun belonging to his father to the murder, setting her boyfriend as the suspect. Will Sean find out who killed Katie? Will Jimmy make it through the investigation? And will Dave ever admit what really happened when he was abducted?",
        "release_date": "15 Oct 2003",
        "runtime": "138 min",
        "genre": "Crime, Drama, Mystery",
        "director": "Clint Eastwood",
        "actors": "Sean Penn, Tim Robbins, Kevin Bacon",
        "rating": "7.9",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTIzNDUyMjA4MV5BMl5BanBnXkFtZTYwNDc4ODM3._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Nightcrawler",
        "year": "2014",
        "overview": "NIGHTCRAWLER is a thriller set in the nocturnal underbelly of contemporary Los Angeles. Jake Gyllenhaal stars as Lou Bloom, a driven young man desperate for work who discovers the high-speed world of L.A. crime journalism. Finding a group of freelance camera crews who film crashes, fires, murder and other mayhem, Lou muscles into the cut-throat, dangerous realm of nightcrawling - where each police siren wail equals a possible windfall and victims are converted into dollars and cents. Aided by Rene Russo as Nina, a veteran of the blood-sport that is local TV news, Lou blurs the line between observer and participant to become the star of his own story.",
        "release_date": "31 Oct 2014",
        "runtime": "117 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Dan Gilroy",
        "actors": "Jake Gyllenhaal, Rene Russo, Bill Paxton",
        "rating": "7.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYjMwMmI5MWQtOTU4OS00OTAyLTg0OTYtNmQ5YzExZTQ3ZWJhXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "No Country for Old Men",
        "year": "2007",
        "overview": "In rural Texas, welder and hunter Llewelyn Moss (Josh Brolin) discovers the remains of several drug runners who have all killed each other in an exchange gone violently wrong. Rather than report the discovery to the police, Moss decides to simply take the two million dollars present for himself. This puts the psychopathic killer, Anton Chigurh (Javier Bardem), on his trail as he dispassionately murders nearly every rival, bystander and even employer in his pursuit of his quarry and the money. As Moss desperately attempts to keep one step ahead, the blood from this hunt begins to flow behind him with relentlessly growing intensity as Chigurh closes in. Meanwhile, the laconic Sheriff Ed Tom Bell (Tommy Lee Jones) blithely oversees the investigation even as he struggles to face the sheer enormity of the crimes he is attempting to thwart.",
        "release_date": "21 Nov 2007",
        "runtime": "122 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Ethan Coen, Joel Coen",
        "actors": "Tommy Lee Jones, Javier Bardem, Josh Brolin",
        "rating": "8.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjA5Njk3MjM4OV5BMl5BanBnXkFtZTcwMTc5MTE1MQ@@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Presence",
        "year": "2024",
        "overview": "A family becomes convinced they are not alone after moving into their new home in the suburbs.",
        "release_date": "24 Jan 2025",
        "runtime": "84 min",
        "genre": "Drama, Horror, Thriller",
        "director": "Steven Soderbergh",
        "actors": "Lucy Liu, Chris Sullivan, Callina Liang",
        "rating": "6.1",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZWRmNzM1YjktM2YyMi00M2YwLWE2YjMtNjgwNTQ3MGU3MzczXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Prisoners",
        "year": "2013",
        "overview": "How far would you go to protect your family? Keller Dover is facing every parent's worst nightmare. His six-year-old daughter, Anna, is missing, together with her young friend, Joy, and as minutes turn to hours, panic sets in. The only lead is a dilapidated RV that had earlier been parked on their street. Heading the investigation, Detective Loki arrests its driver, Alex Jones, but a lack of evidence forces his release. As the police pursue multiple leads and pressure mounts, knowing his child's life is at stake the frantic Dover decides he has no choice but to take matters into his own hands. But just how far will this desperate father go to protect his family?",
        "release_date": "20 Sep 2013",
        "runtime": "153 min",
        "genre": "Crime, Drama, Mystery",
        "director": "Denis Villeneuve",
        "actors": "Hugh Jackman, Jake Gyllenhaal, Viola Davis",
        "rating": "8.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTg0NTIzMjQ1NV5BMl5BanBnXkFtZTcwNDc3MzM5OQ@@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Sicario",
        "year": "2015",
        "overview": "Kate Macer leads a Phoenix based kidnap response unit for the FBI. Following Kate's team leading a raid on a known drug den in nearby Chandler, Kate is recruited to work on a special ops team led by Matt Graver of the CIA, he who is on special assignment for the Department of Defense. They recruited her because they wanted someone with tactical procedures knowledge. Outwardly, the team's mission, which works behind a Delta Force team as its primary gun power as required, is to decapitate a Mexican drug cartel by capturing or dismembering the workings of the main players, cartel head Manuel Díaz, his second in command Guillermo Díaz (Manuel's brother), and drug lord Fausto Alarcón. Kate agrees to the assignment as she feels the work of this team would be more effective in stopping the drug trade in the US than the piecemeal work of her current kidnap response unit. The third on the team is a mysterious Hispanic or Latino man Kate only knows as Alejandro, and who she does not fully trust as she can tell that he is suffering from a very traumatic past. When Kate and the team arrive in El Paso for their first mission, Kate learns that the team's workings are not all they appear on the surface - many of the proceedings which would not be considered above board or legal - despite the end goal being as she knows it to be. Still largely in the dark and only given information on a need to know basis, Kate decides to stick it out with the team if only to discover all that she is not told while still believing in the end goal. She may have changing or at least mixed emotions as she learns more and more about what is going on, including the specific reason why she was recruited.",
        "release_date": "02 Oct 2015",
        "runtime": "121 min",
        "genre": "Action, Crime, Drama",
        "director": "Denis Villeneuve",
        "actors": "Emily Blunt, Josh Brolin, Benicio Del Toro",
        "rating": "7.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjA5NjM3NTk1M15BMl5BanBnXkFtZTgwMzg1MzU2NjE@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "The Amateur",
        "year": "2025",
        "overview": "When his supervisors at the CIA refuse to take action after his wife is killed in a London terrorist attack, a decoder takes matters into his own hands.",
        "release_date": "11 Apr 2025",
        "runtime": "122 min",
        "genre": "Action, Thriller",
        "director": "James Hawes",
        "actors": "Rami Malek, Rachel Brosnahan, Jon Bernthal",
        "rating": "6.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYjhkZjM3ZWYtMjUxMS00YzhlLTkxZWYtMzhkMzFhOTQ1NjRkXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "The Departed",
        "year": "2006",
        "overview": "In this crime-action tour de force, the South Boston state police force is waging war on Irish-American organized crime. Young undercover cop Billy Costigan is assigned to infiltrate the mob syndicate run by gangland chief Frank Costello. While Billy quickly gains Costello's confidence, Colin Sullivan, a hardened young criminal who has infiltrated the state police as an informer for the syndicate is rising to a position of power in the Special Investigation Unit. Each man becomes deeply consumed by their double lives, gathering information about the plans and counter-plans of the operations they have penetrated. But when it becomes clear to both the mob and the police that there is a mole in their midst, Billy and Colin are suddenly in danger of being caught and exposed to the enemy - and each must race to uncover the identity of the other man in time to save themselves. But is either willing to turn on their friends and comrades they've made during their long stints undercover?",
        "release_date": "06 Oct 2006",
        "runtime": "151 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Martin Scorsese",
        "actors": "Leonardo DiCaprio, Matt Damon, Jack Nicholson",
        "rating": "8.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTI1MTY2OTIxNV5BMl5BanBnXkFtZTYwNjQ4NjY3._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "The Killer",
        "year": "2023",
        "overview": "Solitary, cold, methodical and unencumbered by scruples or regrets, a killer waits in the shadows, watching for his next target. Yet, the longer he waits, the more he thinks he's losing his mind, if not his cool.",
        "release_date": "10 Nov 2023",
        "runtime": "118 min",
        "genre": "Action, Adventure, Crime",
        "director": "David Fincher",
        "actors": "Michael Fassbender, Tilda Swinton, Charles Parnell",
        "rating": "6.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYzU2MTlkMTctNWI3MC00ODUzLTlmYzQtMzZjYjVmMmYwZGU0XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "The Nice Guys",
        "year": "2016",
        "overview": "Set against the backdrop of 1977 Los Angeles, The Nice Guys opens when single father and licensed PI Holland March (Gosling) is hired to investigate the apparent suicide of famous porn star Misty Mountains. As the trail leads him to track down a girl named Amelia (Qualley), he encounters less licensed and less hands-off private eye Jackson Healey (Russell Crowe) and his brass knuckles, both hired by the young hippie. However, the situation takes a turn for the worse when Amelia vanishes and it becomes apparent that March wasn't the only party interested. As both men are forced to team up, they'll have to take on a world filled with eccentric goons, strippers dressed as mermaids and even a possible government conspiracy.",
        "release_date": "20 May 2016",
        "runtime": "116 min",
        "genre": "Action, Comedy, Crime",
        "director": "Shane Black",
        "actors": "Russell Crowe, Ryan Gosling, Angourie Rice",
        "rating": "7.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BM2YwNWZlZGEtYTEyZi00NjdjLWEwM2ItM2Q2MDMwZjkzMjk0XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "The Town",
        "year": "2010",
        "overview": "The Charlestown neighborhood of Boston is renowned for churning out a high number of armed robbers, generation after generation. These robbers never leave their Charlestown life on their own volition, the neighborhood where there is an unwritten code to protect that lifestyle. Such robbers include friends Doug MacRay, James Coughlin, Albert 'Gloansy' Magloan and Desmond Elden. Doug and James in particular treat each other like family, as the Coughlins have realistically been as such to Doug since Doug's mother ran off and Doug's father, Stephen MacRay, was sent to prison. James' single mother sister, the drugged out Krista Coughlin, and Doug have a casual sexual relationship. The foursome carry out a mostly successful bank robbery, but due to circumstances take the bank manager, Claire Keesey, hostage for a short period before releasing her physically unharmed. They find out that Claire lives in Charlestown, so they want to ensure that she did not see anything that could incriminate them if they were to ever run into her. As such, Doug begins a personal relationship with her to find out what she knows and what she's told the police and the FBI, who have taken charge of the investigation. He learns that she has kept some information from the authorities for her own protection but information that could identify James in particular. But Doug slowly falls for her, as she does for him. Ultimately, Doug dreams about leaving his Charlestown life to be with Claire anywhere but there. But Doug has to try and keep his true identity from her, and keep the fact that he is seeing her from his colleagues. But leaving is not as easy as he would like as he and the gang are tasked with a big job by a local gangster named Fergie whether Doug likes it or not. And Adam Frawley, the FBI's lead investigator, comes into evidence that links the foursome to the bank robbery and a subsequent armored car heist, so is on their tail for evidence that will send them away dead or alive.",
        "release_date": "17 Sep 2010",
        "runtime": "125 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Ben Affleck",
        "actors": "Ben Affleck, Rebecca Hall, Jon Hamm",
        "rating": "7.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTcyNzcxODg3Nl5BMl5BanBnXkFtZTcwMTUyNjQ3Mw@@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Training Day",
        "year": "2001",
        "overview": "In Los Angeles, a city where streets are overrun by drug dealers, those who have sworn to uphold the law are breaking them to clean up the streets. Denzel Washington plays L.A.P.D. detective Alonzo Harris, a veteran narcotics officer whose methods of enforcing the law are questionable, if not corrupt. 'Training Day' follows Harris as he trains rookie Jake Hoyt over a 24-hour period. Ethical dilemmas arise for Hoyt as well as the audience as questions present themselves as to whether or not Harris' methodology for ridding the streets of South Central Los Angeles of drugs is right or wrong.",
        "release_date": "05 Oct 2001",
        "runtime": "122 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Antoine Fuqua",
        "actors": "Denzel Washington, Ethan Hawke, Scott Glenn",
        "rating": "7.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjRlNjUwOGYtNGQxZS00ZjhkLTg0NDgtYjcwNzZlNDU2YjBlXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Wind River",
        "year": "2017",
        "overview": "East of Boulder Flats, deep into the vast and unforgiving white territory of the Wind River Indian Reservation, the seasoned game tracker, Cory Lambert, discovers the frozen body of the young Native American, Natalie. As this is a federal crime, the F.B.I. dispatches the inexperienced but courageous agent Jane Banner to lead the investigation, however, the unprepared outsider will soon team up with Cory to unravel the mystery of Natalie's murder. Before long, Cory will inevitably have to face his own past, while at the same time, both he and Jane are thirsting to see justice done. In the end, will this be a fruitful alliance?",
        "release_date": "18 Aug 2017",
        "runtime": "107 min",
        "genre": "Crime, Drama, Mystery",
        "director": "Taylor Sheridan",
        "actors": "Elizabeth Olsen, Jeremy Renner, Graham Greene",
        "rating": "7.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTUyMjU1OTUwM15BMl5BanBnXkFtZTgwMDg1NDQ2MjI@._V1_SX300.jpg",
        "category": "Crime Thriller"
    },
    {
        "title": "Harry Potter and the Chamber of Secrets",
        "year": "2002",
        "overview": "Forced to spend his summer holidays with his muggle relations, Harry Potter (Daniel Radcliffe) gets a real shock when he gets a surprise visitor: Dobby (Toby Jones) the house-elf, who warns Harry against returning to Hogwarts, for terrible things are going to happen. Harry decides to ignore Dobby's warning and continues with his pre-arranged schedule. But at Hogwarts, strange and terrible things are indeed happening. Harry is suddenly hearing mysterious voices from inside the walls, muggle-born students are being attacked, and a message scrawled on the wall in blood puts everyone on his or her guard, \"The Chamber Of Secrets Has Been Opened. Enemies Of The Heir, Beware\".",
        "release_date": "15 Nov 2002",
        "runtime": "161 min",
        "genre": "Adventure, Family, Fantasy",
        "director": "Chris Columbus",
        "actors": "Daniel Radcliffe, Rupert Grint, Emma Watson",
        "rating": "7.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNGJhM2M2MWYtZjIzMC00MDZmLThkY2EtOWViMDhhYjRhMzk4XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Harry Potter"
    },
    {
        "title": "Harry Potter and the Deathly Hallows: Part 1",
        "year": "2010",
        "overview": "Voldemort's (Ralph Fiennes') power is growing stronger. He now has control over the Ministry of Magic and Hogwarts. Harry (Daniel Radcliffe), Ron (Rupert Grint), and Hermione (Emma Watson) decide to finish Dumbledore's (Sir Michael Gambon's) work and find the rest of the Horcruxes to defeat the Dark Lord. But little hope remains for the trio and the rest of the Wizarding World, so everything they do must go as planned.",
        "release_date": "19 Nov 2010",
        "runtime": "146 min",
        "genre": "Adventure, Family, Fantasy",
        "director": "David Yates",
        "actors": "Daniel Radcliffe, Emma Watson, Rupert Grint",
        "rating": "7.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTQ2OTE1Mjk0N15BMl5BanBnXkFtZTcwODE3MDAwNA@@._V1_SX300.jpg",
        "category": "Harry Potter"
    },
    {
        "title": "Harry Potter and the Deathly Hallows: Part 2",
        "year": "2011",
        "overview": "Harry (Daniel Radcliffe), Ron (Rupert Grint), and Hermione (Emma Watson) continue their quest of finding and destroying Voldemort's (Ralph Fiennes') three remaining Horcruxes, the magical items responsible for his immortality. But as the mystical Deathly Hallows are uncovered, and Voldemort finds out about their mission, the biggest battle begins, and life as they know it will never be the same again.",
        "release_date": "15 Jul 2011",
        "runtime": "130 min",
        "genre": "Adventure, Family, Fantasy",
        "director": "David Yates",
        "actors": "Daniel Radcliffe, Emma Watson, Rupert Grint",
        "rating": "8.1",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BOTA1Mzc2N2ItZWRiNS00MjQzLTlmZDQtMjU0NmY1YWRkMGQ4XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Harry Potter"
    },
    {
        "title": "Harry Potter and the Goblet of Fire",
        "year": "2005",
        "overview": "Harry's (Daniel Radcliffe's) fourth year at Hogwarts is about to start and he is enjoying the summer vacation with his friends. They get the tickets to The Quidditch World Cup Final, but after the match is over, people dressed like Lord Voldemort's (Ralph Fiennes') \"Death Eaters\" set a fire to all of the visitors' tents, coupled with the appearance of Voldemort's symbol, the \"Dark Mark\" in the sky, which causes a frenzy across the magical community. That same year, Hogwarts is hosting \"The Triwizard Tournament\", a magical tournament between three well-known schools of magic : Hogwarts, Beauxbatons, and Durmstrang. The contestants have to be above the age of seventeen, and are chosen by a magical object called \"The Goblet of Fire\". On the night of selection, however, the Goblet spews out four names instead of the usual three, with Harry unwittingly being selected as the Fourth Champion. Since the magic cannot be reversed, Harry is forced to go with it and brave three exceedingly difficult tasks.",
        "release_date": "18 Nov 2005",
        "runtime": "157 min",
        "genre": "Adventure, Family, Fantasy",
        "director": "Mike Newell",
        "actors": "Daniel Radcliffe, Emma Watson, Rupert Grint",
        "rating": "7.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTI1NDMyMjExOF5BMl5BanBnXkFtZTcwOTc4MjQzMQ@@._V1_SX300.jpg",
        "category": "Harry Potter"
    },
    {
        "title": "Harry Potter and the Half-Blood Prince",
        "year": "2009",
        "overview": "During Harry Potter's sixth year at Hogwarts, he finds a book that once belonged to the mysterious Half-Blood Prince that earns him the respect of his new Potions professor Horace Slughorn. In addition, Dumbledore must prepare Harry for the ultimate final confrontation by finding out the secret behind Voldemort's power. Meanwhile, a hidden enemy waits in the shadows to carry out a mission given to him by the Dark Lord.",
        "release_date": "15 Jul 2009",
        "runtime": "153 min",
        "genre": "Action, Adventure, Family",
        "director": "David Yates",
        "actors": "Daniel Radcliffe, Emma Watson, Rupert Grint",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNzU3NDg4NTAyNV5BMl5BanBnXkFtZTcwOTg2ODg1Mg@@._V1_SX300.jpg",
        "category": "Harry Potter"
    },
    {
        "title": "Harry Potter and the Order of the Phoenix",
        "year": "2007",
        "overview": "After a lonely summer on Privet Drive, Harry (Daniel Radcliffe) returns to a Hogwarts full of ill-fortune. Few of students and parents believe him or Dumbledore (Sir Michael Gambon) that Voldemort (Ralph Fiennes) is really back. The ministry had decided to step in by appointing a new Defense Against the Dark Arts teacher, Professor Dolores Umbridge (Imelda Staunton), who proves to be the nastiest person Harry has ever encountered. Harry also can't help stealing glances with the beautiful Cho Chang (Katie Leung). To top it off are dreams that Harry can't explain, and a mystery behind something for which Voldemort is searching. With these many things, Harry begins one of his toughest years at Hogwarts School of Witchcraft and Wizardry.",
        "release_date": "11 Jul 2007",
        "runtime": "138 min",
        "genre": "Action, Adventure, Family",
        "director": "David Yates",
        "actors": "Daniel Radcliffe, Emma Watson, Rupert Grint",
        "rating": "7.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYWJmM2M1YzItMjY1Ni00YzRmLTg5YWYtNDFmNTJjNzQ0ODkyXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Harry Potter"
    },
    {
        "title": "Harry Potter and the Prisoner of Azkaban",
        "year": "2004",
        "overview": "Harry Potter (Daniel Radcliffe) is having a tough time with his relatives (yet again). He runs away after using magic to inflate Uncle Vernon's (Richard Griffiths') sister Marge (Pam Ferris), who was being offensive towards Harry's parents. Initially scared for using magic outside the school, he is pleasantly surprised that he won't be penalized after all. However, he soon learns that a dangerous criminal and Voldemort's trusted aide Sirius Black (Gary Oldman) has escaped from Azkaban Prison and wants to kill Harry to avenge the Dark Lord. To worsen the conditions for Harry, vile creatures called Dementors are appointed to guard the school gates and inexplicably happen to have the most horrible effect on him. Little does Harry know that by the end of this year, many holes in his past (whatever he knows of it) will be filled up and he will have a clearer vision of what the future has in store.",
        "release_date": "04 Jun 2004",
        "runtime": "142 min",
        "genre": "Adventure, Family, Fantasy",
        "director": "Alfonso Cuarón",
        "actors": "Daniel Radcliffe, Emma Watson, Rupert Grint",
        "rating": "7.9",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTY4NTIwODg0N15BMl5BanBnXkFtZTcwOTc0MjEzMw@@._V1_SX300.jpg",
        "category": "Harry Potter"
    },
    {
        "title": "Den of Thieves",
        "year": "2018",
        "overview": "A gritty L.A crime saga which follows the intersecting and often personally connected lives of an elite unit of the LA County Sheriff's Dept. and the state's most successful bank robbery crew as the outlaws plan an impossible heist on the Federal Reserve Bank of downtown Los Angeles.",
        "release_date": "19 Jan 2018",
        "runtime": "140 min",
        "genre": "Action, Crime, Drama",
        "director": "Christian Gudegast",
        "actors": "Gerard Butler, Pablo Schreiber, O'Shea Jackson Jr.",
        "rating": "7.0",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMzYyODcwMDAyM15BMl5BanBnXkFtZTgwOTA4MjIwNDI@._V1_SX300.jpg",
        "category": "Heist"
    },
    {
        "title": "Inside Man",
        "year": "2006",
        "overview": "Composed and meticulous, the soft-spoken and ingenious bank robber, Dalton Russell, has orchestrated the perfect heist--shortly, the Manhattan bank at the corner of Wall Street and Broadway along with dozens of hostages will be his to command. Try as he might, the rough hostage negotiator, Keith Frazier, is always one step behind the criminal mastermind--and what is more disheartening--the institution's silver-haired founder, Arthur Case, recruits the intelligent problem-fixer, Madeline White, to retrieve something of paramount importance. However, the thieves seem to procrastinate intentionally, when they should be rushing into action. Will Arthur and Madeline get what they want this time?",
        "release_date": "24 Mar 2006",
        "runtime": "129 min",
        "genre": "Crime, Drama, Mystery",
        "director": "Spike Lee",
        "actors": "Denzel Washington, Clive Owen, Jodie Foster",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZWFmMDZkYjktMjYyOS00MTM2LTg2MmQtOTUwMzJjMDlhZDY1XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Heist"
    },
    {
        "title": "Logan Lucky",
        "year": "2017",
        "overview": "When Jimmy Logan (Channing Tatum) gets fired, he convinces his brother Clyde (Adam Driver) and sister Mellie (Riley Keough) to help him rob the Charlotte Motor Speedway during a NASCAR Race. But they will need the help of Joe Bang (Daniel Craig), a convicted safe-cracker who is currently doing time. All they have to do is break Joe out, blow the racetrack vault, get away with the cash, return Joe to prison, and get Jimmy to his daughter's beauty pageant on time. What could possibly go wrong? Well, there is the Logan family curse .",
        "release_date": "18 Aug 2017",
        "runtime": "118 min",
        "genre": "Action, Comedy, Crime",
        "director": "Steven Soderbergh",
        "actors": "Channing Tatum, Adam Driver, Daniel Craig",
        "rating": "7.0",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTYyODg0NDU1OV5BMl5BanBnXkFtZTgwNjcxMzU0MjI@._V1_SX300.jpg",
        "category": "Heist"
    },
    {
        "title": "Red One",
        "year": "2024",
        "overview": "After Santa Claus is kidnapped, the North Pole's Head of Security must team up with a notorious hacker in a globe-trotting, action-packed mission to save Christmas.",
        "release_date": "15 Nov 2024",
        "runtime": "123 min",
        "genre": "Action, Adventure, Comedy",
        "director": "Jake Kasdan",
        "actors": "Dwayne Johnson, Chris Evans, Lucy Liu",
        "rating": "6.3",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZmFkMjE4NjQtZTVmZS00MDZjLWE2ZmEtZTkzODljNjhlNWUxXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Heist"
    },
    {
        "title": "The Score",
        "year": "2001",
        "overview": "Three generations of method acting giants unite for this crime thriller written by Kario Salem and directed by Frank Oz. Robert De Niro stars as Nick Wells, an aging thief whose specialty is safe-cracking and who is on the verge of retiring to a life of ease, running his jazz club and romancing his girlfriend Diane (Angela Bassett). But before he can ride off into the sunset, Nick is pressured to do one last job by his mentor and business partner, a flamboyant and extravagant upscale fence named Max (Marlon Brando). Max is plotting the heist of the Montreal Customs House, and he's got a man on the inside, Jackie Teller (Edward Norton), a talented but volatile crook who has managed to ingratiate himself with the facility's staff as a fellow employee suffering from cerebral palsy. Jackie bristles at Nick's interference in \"his\" score, however, and threatens violence when it seems he's going to be cut out of the action. In the meantime, Nick grows increasingly ill at ease about the operation, as it violates his two most important dictum in thievery: always work alone and never pull a job in your own city.",
        "release_date": "13 Jul 2001",
        "runtime": "124 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Frank Oz",
        "actors": "Robert De Niro, Edward Norton, Marlon Brando",
        "rating": "6.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZmI3Mjk4NGMtYjhmOC00NjYzLThhNWQtYWUwZDc3Y2ZkZTA1XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Heist"
    },
    {
        "title": "Triple Frontier",
        "year": "2019",
        "overview": "Five former Special Forces operatives reunite to plan a heist in a sparsely populated multi-border zone of South America. For the first time in their prestigious careers these unsung heroes undertake this dangerous mission for self instead of country. But when events take an unexpected turn and threaten to spiral out of control, their skills, their loyalties and their morals are pushed to a breaking point in an epic battle for survival.",
        "release_date": "13 Mar 2019",
        "runtime": "125 min",
        "genre": "Action, Adventure, Thriller",
        "director": "J.C. Chandor",
        "actors": "Ben Affleck, Oscar Isaac, Charlie Hunnam",
        "rating": "6.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BODU4MzM2MDAxMl5BMl5BanBnXkFtZTgwNDEzNjM0NzM@._V1_SX300.jpg",
        "category": "Heist"
    },
    {
        "title": "Widows",
        "year": "2018",
        "overview": "\"Widows\" is the story of four women with nothing in common, except a debt left behind by their dead husbands' criminal activities. Set in contemporary Chicago, amid a time of turmoil, tensions build when Veronica (Viola Davis), Alice (Elizabeth Debicki), Linda (Michelle Rodriguez) and Belle (Cynthia Erivo) take their fate into their own hands and conspire to forge a future on their own terms.",
        "release_date": "16 Nov 2018",
        "runtime": "129 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Steve McQueen",
        "actors": "Viola Davis, Michelle Rodriguez, Elizabeth Debicki",
        "rating": "6.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjM3ODc5NDEyOF5BMl5BanBnXkFtZTgwMTI4MDcxNjM@._V1_SX300.jpg",
        "category": "Heist"
    },
    {
        "title": "Casino Royale",
        "year": "2006",
        "overview": "James Bond (Daniel Craig) goes on his first mission as a 00. Le Chiffre (Mads Mikkelsen) is a banker to the world's terrorists. He is participating in a poker game at Montenegro, where he must win back his money, in order to stay safe amongst the terrorist market. The boss of MI6, known simply as \"M\" (Dame Judi Dench) sends Bond, along with Vesper Lynd Eva Green) to attend this game and prevent Le Chiffre from winning. Bond, using help from Felix Leiter (Jeffrey Wright), Rene Mathis (Giancarlo Giannini), and having Vesper pose as his partner, enters the most important poker game in his already dangerous career. But if Bond defeats Le Chiffre, will he and Vesper Lynd remain safe?",
        "release_date": "17 Nov 2006",
        "runtime": "144 min",
        "genre": "Action, Adventure, Thriller",
        "director": "Martin Campbell",
        "actors": "Daniel Craig, Eva Green, Judi Dench",
        "rating": "8.0",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMWQ1ZDM4NDktMWY0NC00MjcxLWJlMDMtNmE2MGVhYzRjMWQ0XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "James Bond"
    },
    {
        "title": "No Time to Die",
        "year": "2021",
        "overview": "Bond has left active service and is enjoying a tranquil life in Jamaica. His peace is short-lived when his old friend Felix Leiter from the CIA turns up asking for help. The mission to rescue a kidnapped scientist turns out to be far more treacherous than expected, leading Bond onto the trail of a mysterious villain armed with dangerous new technology.",
        "release_date": "08 Oct 2021",
        "runtime": "163 min",
        "genre": "Action, Adventure, Thriller",
        "director": "Cary Joji Fukunaga",
        "actors": "Daniel Craig, Ana de Armas, Rami Malek",
        "rating": "7.3",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZGZiOGZhZDQtZmRkNy00ZmUzLTliMGEtZGU0NjExOGMxZDVkXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "James Bond"
    },
    {
        "title": "Quantum of Solace",
        "year": "2008",
        "overview": "Is there solace in revenge? James Bond (Daniel Craig) and M (Dame Judi Dench) sniff a shadowy international network of power and corruption reaping billions. As Bond pursues the agents of an assassination attempt on M, all roads lead to Dominic Greene (Mathieu Amalric), a world-renowned developer of green technology. Greene, a nasty piece of work, is intent on securing a barren area of Bolivia in exchange for helping a strongman stage a coup there. The C.I.A. looks the other way, and only Bond, with help from a retired spy and a mysterious beauty, stands in Greene's way. M wonders if she can trust Bond, or if vengeance possesses him. Can anyone drawn to Bond live to tell the tale?",
        "release_date": "14 Nov 2008",
        "runtime": "106 min",
        "genre": "Action, Adventure, Mystery",
        "director": "Marc Forster",
        "actors": "Daniel Craig, Olga Kurylenko, Mathieu Amalric",
        "rating": "6.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYmMwZTA3MTAtNWU0Yy00NGZmLTg0YmItZTVkZGFjZTI1ZWJiXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "James Bond"
    },
    {
        "title": "Spectre",
        "year": "2015",
        "overview": "A cryptic message from the past sends James Bond (Daniel Craig) on a rogue mission to Mexico City and eventually Rome, where he meets Lucia Sciarra (Monica Belluci), the beautiful and forbidden widow of an infamous criminal. Bond infiltrates a secret meeting and uncovers the existence of the sinister organisation known as S.P.E.C.T.R.E. Meanwhile, back in London, Max Denbigh (Andrew Scott), the new head of the Centre of National Security, questions Bond's actions and challenges the relevance of MI6, led by M (Ralph Fiennes). Bond covertly enlists Miss Eve Moneypenny (Naomie Harris) and Q (Ben Whishaw) to help him seek out Dr. Madeleine Swann (Léa Seydoux), the daughter of his old nemesis Mr. White (Jesper Christensen), who may hold the clue to untangling the web of S.P.E.C.T.R.E. As the daughter of the assassin, she understands Bond in a way most others cannot. As Bond ventures towards the heart of S.P.E.C.T.R.E., he learns a chilling connection between him and the enemy he seeks.",
        "release_date": "06 Nov 2015",
        "runtime": "148 min",
        "genre": "Action, Adventure, Thriller",
        "director": "Sam Mendes",
        "actors": "Daniel Craig, Christoph Waltz, Léa Seydoux",
        "rating": "6.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMzA5MzFiNDAtYTI0NC00MDE5LTljYTctYTNkODk1OTZlODI5XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "James Bond"
    },
    {
        "title": "American Hustle",
        "year": "2013",
        "overview": "A fictional film set in the alluring world of one of the most stunning scandals to rock our nation, American Hustle tells the story of brilliant con man Irving Rosenfeld (Christian Bale), who along with his equally cunning and seductive British partner Sydney Prosser (Amy Adams) is forced to work for a wild FBI agent Richie DiMaso (Bradley Cooper). DiMaso pushes them into a world of Jersey powerbrokers and mafia that's as dangerous as it is enchanting. Jeremy Renner is Carmine Polito, the passionate, volatile, New Jersey political operator caught between the con-artists and Feds. Irving's unpredictable wife Rosalyn (Jennifer Lawrence) could be the one to pull the thread that brings the entire world crashing down.",
        "release_date": "20 Dec 2013",
        "runtime": "138 min",
        "genre": "Crime, Drama",
        "director": "David O. Russell",
        "actors": "Christian Bale, Amy Adams, Bradley Cooper",
        "rating": "7.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMGQ2NzEwZGEtYjk1MC00NWFmLTgyYTgtZmRhMTRmOTBlN2U5XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christian Bale"
    },
    {
        "title": "American Psycho",
        "year": "2000",
        "overview": "It's the late 1980s. Twenty-seven year old Wall Streeter Patrick Bateman travels among a closed network of the proverbial beautiful people, that closed network in only they able to allow others like themselves in in a feeling of superiority. Patrick has a routinized morning regimen to maintain his appearance of attractiveness and fitness. He, like those in his network, are vain, narcissistic, egomaniacal and competitive, always having to one up everyone else in that presentation of oneself, but he, unlike the others, realizes that, for himself, all of these are masks to hide what is truly underneath, someone/something inhuman in nature. In other words, he is comprised of a shell resembling a human that contains only greed and disgust, greed in wanting what others may have, and disgust for those who do not meet his expectations and for himself in not being the first or the best. That disgust ends up manifesting itself in wanting to rid the world of those people, he not seeing them as people but only of those characteristics he wants to rid.",
        "release_date": "14 Apr 2000",
        "runtime": "102 min",
        "genre": "Crime, Drama, Horror",
        "director": "Mary Harron",
        "actors": "Christian Bale, Justin Theroux, Josh Lucas",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNzBjM2I5ZjUtNmIzNy00OGNkLWIwZDMtOTAwYWUwMzA2YjdlXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christian Bale"
    },
    {
        "title": "Amsterdam",
        "year": "2022",
        "overview": "In the 1930s, three friends witness a murder, are framed for it, and uncover one of the most outrageous plots in American history.",
        "release_date": "07 Oct 2022",
        "runtime": "134 min",
        "genre": "Comedy, Drama, History",
        "director": "David O. Russell",
        "actors": "Christian Bale, Margot Robbie, John David Washington",
        "rating": "6.1",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNzgxNTQzYTEtMDI3Yi00OGQ1LWFkNGMtZDEyM2JlYmE0YzUyXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christian Bale"
    },
    {
        "title": "Ford v Ferrari",
        "year": "2019",
        "overview": "As Enzo Ferrari's fast Rosso-Corsa racing cars dominate the mid-1960s motorsport world, the American car designer, Carroll Shelby, is forced to retire after winning the demanding 1959 '24 Hours of Le Mans' endurance race. But, before long, an unexpected proposition by the Vice President of Henry Ford's motor company, Lee Iacocca, will offer an opportunity to beat the Italians at their own game. Now, under those pressing circumstances, the British sports car driver and racing engineer, Ken Miles, reluctantly agrees to lend a hand and improve the firm's image, as Ford's race team has less than ninety days to rewrite history. As a result, the non-conformist duo comes up with the mighty Ford GT40 Mk I high-performance racing car. Can Shelby and Miles break Ferrari's streak?",
        "release_date": "15 Nov 2019",
        "runtime": "152 min",
        "genre": "Action, Biography, Drama",
        "director": "James Mangold",
        "actors": "Matt Damon, Christian Bale, Jon Bernthal",
        "rating": "8.1",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BOTBjNTEyNjYtYjdkNi00YzE5LTljYzUtZjVlYmYwZmJmZWYxXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christian Bale"
    },
    {
        "title": "Out of the Furnace",
        "year": "2013",
        "overview": "Russell and his younger brother Rodney live in the economically depressed Rust Belt and have always dreamed of escaping and finding better lives. But when a cruel twist of fate lands Russell in prison, Rodney becomes involved with one of the most violent and ruthless crime rings in the Northeast - a mistake that will cost him everything. Once released, Russell must choose between his own freedom or risking it all to seek justice for his brother.",
        "release_date": "06 Dec 2013",
        "runtime": "116 min",
        "genre": "Crime, Drama, Thriller",
        "director": "Scott Cooper",
        "actors": "Christian Bale, Casey Affleck, Zoe Saldaña",
        "rating": "6.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYjAwNTQzNmUtZTBkYy00ZGZjLThjMmQtODk5YzdmMTBhNDk2XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christian Bale"
    },
    {
        "title": "The Big Short",
        "year": "2015",
        "overview": "Three separate but parallel stories of the U.S mortgage housing crisis of 2005 are told. Michael Burry, an eccentric ex-physician turned one-eyed Scion Capital hedge fund manager, has traded traditional office attire for shorts, bare feet and a Supercuts haircut. He believes that the US housing market is built on a bubble that will burst within the next few years. Autonomy within the company allows Burry to do largely as he pleases, so Burry proceeds to bet against the housing market with the banks, who are more than happy to accept his proposal for something that has never happened in American history. The banks believe that Burry is a crackpot and therefore are confident in that they will win the deal. Jared Vennett with Deutschebank gets wind of what Burry is doing and, as an investor believes he too can cash in on Burry's beliefs. An errant telephone call to FrontPoint Partners gets this information into the hands of Mark Baum, an idealist who is fed up with the corruption in the financial industry. Baum and his associates, who work at an arms length under Morgan Stanley, decide to join forces with Vennett despite not totally trusting him. In addition to Burry's information, they further believe that most of the mortgages are overrated by the bond agencies, with the banks collating all the sub-prime mortgages under AAA packages. Charlie Geller and Jamie Shipley, who are minor players in a $30 million start-up garage company called Brownfield, get a hold of Vennett's prospectus on the matter. Wanting in on the action but not having the official clout to play, they decide to call an old \"friend\", retired investment banker Ben Rickert, to help out. All three of these groups work on the premise that the banks are stupid and don't know what's going on, while for them to win, the general economy has to lose, which means the suffering of the general investor who trusts the financial institutions. That latter aspect may not sit well with Baum. Some of these assumptions may be incorrect and may be far more manipulative than they could have ever imagined, which in turn may throw curves into the process.",
        "release_date": "23 Dec 2015",
        "runtime": "130 min",
        "genre": "Biography, Comedy, Drama",
        "director": "Adam McKay",
        "actors": "Christian Bale, Steve Carell, Ryan Gosling",
        "rating": "7.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZDZkNDQ3YjktYjBlZC00YTY1LTgxOGYtY2RhMWFhZmNkZGY3XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christian Bale"
    },
    {
        "title": "The Fighter",
        "year": "2010",
        "overview": "The Fighter is a drama about boxer \"Irish\" Micky Ward's unlikely road to the world light welterweight title. His Rocky-like rise was shepherded by half-brother Dicky, a boxer-turned-trainer on the verge of being KO'd by drugs and crime.",
        "release_date": "17 Dec 2010",
        "runtime": "116 min",
        "genre": "Action, Biography, Drama",
        "director": "David O. Russell",
        "actors": "Mark Wahlberg, Christian Bale, Amy Adams",
        "rating": "7.8",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTM0ODk3MjM1MV5BMl5BanBnXkFtZTcwNzc1MDIwNA@@._V1_SX300.jpg",
        "category": "Christian Bale"
    },
    {
        "title": "The Machinist",
        "year": "2004",
        "overview": "Trevor Reznik is a machinist in a factory. An extreme case of insomnia has led to him not sleeping in a year, and his body withering away to almost nothing. He has an obsessive compulsion to write himself reminder notes and keep track of his dwindling weight, both scribbled on yellow stickies in his apartment. The only person he lets into his life in an emotional sense is Stevie, a prostitute, although he has an infatuation with Maria, a single mother waitress working in an airport diner. His co-workers don't associate with and mistrust him because of not knowing what is going on in his life that has led to his emaciated physical appearance. A workplace incident further alienates him with his coworkers, and in conjunction with some unfamiliar pieces of paper he finds in his apartment, Trevor believes that someone or some people - probably one or some of his coworkers - are out to get him, using a phantom employee named Ivan as their front. As Trevor goes on a search for evidence as to Ivan's schemes and whereabouts, Trevor may come to a true understanding of what has caused his insomnia.",
        "release_date": "03 Dec 2004",
        "runtime": "101 min",
        "genre": "Drama, Thriller",
        "director": "Brad Anderson",
        "actors": "Christian Bale, Jennifer Jason Leigh, Aitana Sánchez-Gijón",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BY2I1MmUxYmMtZjk3OC00N2MwLWI2YjAtNGQxODA1Y2I3YTI4XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Christian Bale"
    },
    {
        "title": "Django Unchained",
        "year": "2012",
        "overview": "In 1858, a bounty-hunter named King Schultz seeks out a slave named Django and buys him because he needs him to find some men he is looking for. After finding them, Django wants to find his wife, Broomhilda, who along with him were sold separately by his former owner for trying to escape. Schultz offers to help him if he chooses to stay with him and be his partner. Eventually they learn that she was sold to a plantation in Mississippi. Knowing they can't just go in and say they want her, they come up with a plan so that the owner will welcome them into his home and they can find a way.",
        "release_date": "25 Dec 2012",
        "runtime": "165 min",
        "genre": "Drama, Western",
        "director": "Quentin Tarantino",
        "actors": "Jamie Foxx, Christoph Waltz, Leonardo DiCaprio",
        "rating": "8.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjIyNTQ5NjQ1OV5BMl5BanBnXkFtZTcwODg1MDU4OA@@._V1_SX300.jpg",
        "category": "Leonardo Di Caprio"
    },
    {
        "title": "Gangs of New York",
        "year": "2002",
        "overview": "In the god-forsaken district of early-1860s Lower Manhattan known as the Five Points, the vicious Nativist, Bill \"The Butcher\" Cutting, is the supreme overlord of an area riddled with crime, prostitution, theft and murder, as the American Civil War still rages on. Sixteen whole years after the brutal murder of his father from Bill's blood-stained hands, an orphaned Irish-American, Amsterdam Vallon, returns to this melting pot of corruption to avenge his untimely death; however, a lot has changed since then. Who can remember the once-innocent boy and now a young man bent on revenge, who works his way up to the hierarchy of Five Points? Will Amsterdam ever taste the dangerous but sweet fruit of retribution?",
        "release_date": "20 Dec 2002",
        "runtime": "167 min",
        "genre": "Crime, Drama",
        "director": "Martin Scorsese",
        "actors": "Leonardo DiCaprio, Cameron Diaz, Daniel Day-Lewis",
        "rating": "7.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTQ0MDA0MTUtYzkzMi00NDY3LThhZDEtNGM4MWUwYzMyZDk5XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Leonardo Di Caprio"
    },
    {
        "title": "J. Edgar",
        "year": "2011",
        "overview": "Biopic of J. Edgar Hoover (Leonardo DiCaprio) told by Hoover as he recalls his career for a biography. Early in his career, Hoover fixated on Communists, anarchists, and any other revolutionary taking action against the U.S. government. He slowly builds the agency's reputation, becoming the sole arbiter of who gets hired and fired. One of his hires is Clyde Tolson (Armie Hammer), who is quickly promoted to Assistant Director and was Hoover's confidant and companion for the rest of Hoover's life. Hoover's memories have him playing a greater role in the many high profile cases in which the F.B.I. was involved, the Lindbergh baby kidnapping, the arrest of bank robbers like John Dillinger, and also show him to be quite adept at manipulating the various politicians with whom he worked over his career, thanks in large part to his secret files.",
        "release_date": "11 Nov 2011",
        "runtime": "137 min",
        "genre": "Biography, Drama, Romance",
        "director": "Clint Eastwood",
        "actors": "Leonardo DiCaprio, Armie Hammer, Naomi Watts",
        "rating": "6.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTc0NDM4ODU2Nl5BMl5BanBnXkFtZTcwNzQ0NTg4Ng@@._V1_SX300.jpg",
        "category": "Leonardo Di Caprio"
    },
    {
        "title": "Once Upon a Time in Hollywood Live Q&A",
        "year": "2019",
        "overview": "A live Q&amp;A with Quentin Tarantino, Leonardo DiCaprio, Brad Pitt and Margot Robbie discussing \"Once Upon a Time in Hollywood\" with host Jim Hemphill.",
        "release_date": "02 Nov 2019",
        "runtime": "N/A",
        "genre": "N/A",
        "director": "N/A",
        "actors": "Leonardo DiCaprio, Jim Hemphill, Brad Pitt",
        "rating": "N/A",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BOGNmMjJiZTAtMTM0ZS00OTNiLWE1M2ItYjk0YzBjNTkzMTYzXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Leonardo Di Caprio"
    },
    {
        "title": "The Aviator",
        "year": "2004",
        "overview": "Biopic of billionaire Howard Hughes, starting with his early filmmaking years as owner of R.K.O. Pictures, but mostly focusing on his role in designing and promoting new aircraft. Hughes was a risk-taker spending several fortunes on designing experimental aircraft and eventually founding TWA as a rival to Pan Am airlines owned by his great rival Juan Trippe. When Trippe's politico Senator Ralph Owen Brewster accuses Hughes of being a war profiteer, it's Hughes who gains the upper hand. Hughes also had many women in his life including a long relationship with Katharine Hepburn. From an early age, however, Hughes was also germophobic and would have severe bouts of mental illness.",
        "release_date": "25 Dec 2004",
        "runtime": "170 min",
        "genre": "Biography, Drama",
        "director": "Martin Scorsese",
        "actors": "Leonardo DiCaprio, Cate Blanchett, Kate Beckinsale",
        "rating": "7.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYTUyYWJlNDgtOTM5Ny00YTQ3LWFmYTgtZjJiNTNkYjJlMmY4XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Leonardo Di Caprio"
    },
    {
        "title": "The Revenant",
        "year": "2015",
        "overview": "While exploring uncharted wilderness in 1823, legendary frontiersman Hugh Glass sustains injuries from a brutal bear attack. When his hunting team leaves him for dead, Glass must utilize his survival skills to find a way back home while avoiding natives on their own hunt. Grief-stricken and fueled by vengeance, Glass treks through the wintry terrain to track down John Fitzgerald, the former confidant who betrayed and abandoned him.",
        "release_date": "08 Jan 2016",
        "runtime": "156 min",
        "genre": "Adventure, Drama, Western",
        "director": "Alejandro G. Iñárritu",
        "actors": "Leonardo DiCaprio, Tom Hardy, Will Poulter",
        "rating": "8.0",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYTgwNmQzZDctMjNmOS00OTExLTkwM2UtNzJmOTJhODFjOTdlXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Leonardo Di Caprio"
    },
    {
        "title": "The Wolf of Wall Street",
        "year": "2013",
        "overview": "In the early 1990s, Jordan Belfort teamed with his partner Donny Azoff and started brokerage firm Stratton Oakmont. Their company quickly grows from a staff of 20 to a staff of more than 250 and their status in the trading community and Wall Street grows exponentially. So much that companies file their initial public offerings through them. As their status grows, so do the amount of substances they abuse, and so do their lies. They draw attention like no other, throwing lavish parties for their staff when they hit the jackpot on high trades. That ultimately leads to Belfort featured on the cover of Forbes Magazine, being called \"The Wolf Of Wall St.\". With the FBI onto Belfort's trading schemes, he devises new ways to cover his tracks and watch his fortune grow. Belfort ultimately comes up with a scheme to stash their cash in a European bank. But with the FBI watching him like a hawk, how long will Belfort and Azoff be able to maintain their elaborate wealth and luxurious lifestyles?",
        "release_date": "25 Dec 2013",
        "runtime": "180 min",
        "genre": "Biography, Comedy, Crime",
        "director": "Martin Scorsese",
        "actors": "Leonardo DiCaprio, Jonah Hill, Margot Robbie",
        "rating": "8.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjIxMjgxNTk0MF5BMl5BanBnXkFtZTgwNjIyOTg2MDE@._V1_SX300.jpg",
        "category": "Leonardo Di Caprio"
    },
    {
        "title": "Jack Reacher",
        "year": "2012",
        "overview": "In an innocent heartland city, five are shot dead by an expert sniper. The police quickly identify and arrest the culprit, and build a slam-dunk case. But instead of confessing, the accused man writes the words, \"Get Jack Reacher.\" Reacher himself sees the news report and turns up in the city. The defense is immensely relieved, but Reacher has come to bury the guy. Shocked at the accused's request, Reacher sets out to confirm for himself the absolute certainty of the man's guilt, but comes up with more than he bargained for.",
        "release_date": "21 Dec 2012",
        "runtime": "130 min",
        "genre": "Action, Thriller",
        "director": "Christopher McQuarrie",
        "actors": "Tom Cruise, Rosamund Pike, Richard Jenkins",
        "rating": "7.0",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTM1NjUxMDI3OV5BMl5BanBnXkFtZTcwNjg1ODM3OA@@._V1_SX300.jpg",
        "category": "Tom Cruise"
    },
    {
        "title": "Minority Report",
        "year": "2002",
        "overview": "In the year 2054 A.D. crime is virtually eliminated from Washington D.C. thanks to an elite law enforcing squad \"Precrime\". They use three gifted humans (called \"Pre-Cogs\") with special powers to see into the future and predict crimes beforehand. John Anderton heads Precrime and believes the system's flawlessness steadfastly. However one day the Pre-Cogs predict that Anderton will commit a murder himself in the next 36 hours. Worse, Anderton doesn't even know the victim. He decides to get to the mystery's core by finding out the 'minority report' which means the prediction of the female Pre-Cog Agatha that \"might\" tell a different story and prove Anderton innocent.",
        "release_date": "21 Jun 2002",
        "runtime": "145 min",
        "genre": "Action, Crime, Mystery",
        "director": "Steven Spielberg",
        "actors": "Tom Cruise, Colin Farrell, Samantha Morton",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BYTdmNzM3YzItZTRkYS00MTY5LTg4ZmItNjFmNTk2N2Q2NmNlXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Tom Cruise"
    },
    {
        "title": "Top Gun",
        "year": "1986",
        "overview": "Call-sign \"Maverick\", LT Pete Mitchell, the impetuous daredevil Navy-pilot ace, is accepted into Miramar's elite Fighter School, also known as \"Top Gun\". There, as the impulsive pilot competes with the best of the best, not only will he meet Charlie, the flying school's curvaceous astrophysics instructor, but also the brilliant and highly competitive fellow student, \"Iceman\", with whom right from the start, he will engage in a reckless contest. As Maverick is haunted by his father's mysterious death, will he be able to suppress his wild nature to win the prestigious Top Gun Trophy?",
        "release_date": "16 May 1986",
        "runtime": "109 min",
        "genre": "Action, Drama",
        "director": "Tony Scott",
        "actors": "Tom Cruise, Tim Robbins, Kelly McGillis",
        "rating": "7.0",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZmVjNzQ3MjYtYTZiNC00Y2YzLWExZTEtMTM2ZDllNDI0MzgyXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Tom Cruise"
    },
    {
        "title": "Top Gun: Maverick",
        "year": "2022",
        "overview": "The story involves Maverick confronting his past while training a group of younger Top Gun graduates, including the son of his deceased best friend, for a dangerous mission.",
        "release_date": "27 May 2022",
        "runtime": "130 min",
        "genre": "Action, Drama",
        "director": "Joseph Kosinski",
        "actors": "Tom Cruise, Jennifer Connelly, Miles Teller",
        "rating": "8.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMDBkZDNjMWEtOTdmMi00NmExLTg5MmMtNTFlYTJlNWY5YTdmXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Tom Cruise"
    },
    {
        "title": "Vanilla Sky",
        "year": "2001",
        "overview": "Incarcerated and charged with murder, David Aames Jr. is telling the story of how he got to where he is to McCabe, the police psychologist. That story includes: being the 51% shareholder of a major publishing firm, which he inherited from his long deceased parents; the firm's board, appointed by David Aames Sr., being the 49% shareholders who would probably like to see him gone as they see him as being too irresponsible and immature to run the company; his best bro friendship with author, Brian Shelby; his \"friends with benefits\" relationship with Julie Gianni, who saw their relationship in a slightly different light; his budding romance with Sofia Serrano, who Brian brought to David's party as his own date and who Brian saw as his own possible life mate; and being in an accident which disfigured his face and killed the person who caused the accident. But as the story proceeds, David isn't sure what is real and what is a dream/nightmare as many facets of the story are incompatible to be all real. The mysterious man in the restaurant may be able to shed some light on David's confusion.",
        "release_date": "14 Dec 2001",
        "runtime": "136 min",
        "genre": "Fantasy, Mystery, Romance",
        "director": "Cameron Crowe",
        "actors": "Tom Cruise, Penélope Cruz, Cameron Diaz",
        "rating": "6.9",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNTg5YmYyMzAtYmEzZi00MzA2LWIxMTMtZTc1N2ZjNTA3ZDU2XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Tom Cruise"
    },
    {
        "title": "Arrival",
        "year": "2016",
        "overview": "Linguistics professor Louise Banks leads an elite team of investigators when gigantic spaceships touchdown in 12 locations around the world. As nations teeter on the verge of global war, Banks and her crew must race against time to find a way to communicate with the extraterrestrial visitors. Hoping to unravel the mystery, she takes a chance that could threaten her life and quite possibly all of mankind.",
        "release_date": "11 Nov 2016",
        "runtime": "116 min",
        "genre": "Drama, Mystery, Sci-Fi",
        "director": "Denis Villeneuve",
        "actors": "Amy Adams, Jeremy Renner, Forest Whitaker",
        "rating": "7.9",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTExMzU0ODcxNDheQTJeQWpwZ15BbWU4MDE1OTI4MzAy._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "Blade Runner 2049",
        "year": "2017",
        "overview": "Thirty years after the events of Blade Runner (1982), a new Blade Runner, L.A.P.D. Officer \"K\" (Ryan Gosling), unearths a long-buried secret that has the potential to plunge what's left of society into chaos. K's discovery leads him on a quest to find Rick Deckard (Harrison Ford), a former L.A.P.D. Blade Runner, who has been missing for thirty years.",
        "release_date": "06 Oct 2017",
        "runtime": "164 min",
        "genre": "Action, Drama, Mystery",
        "director": "Denis Villeneuve",
        "actors": "Harrison Ford, Ryan Gosling, Ana de Armas",
        "rating": "8.0",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNzA1Njg4NzYxOV5BMl5BanBnXkFtZTgwODk5NjU3MzI@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "Dark City",
        "year": "1998",
        "overview": "John Murdoch awakens alone in a strange hotel to find that he has lost his memory and is wanted for a series of brutal and bizarre murders. While trying to piece together his past, he stumbles upon a fiendish underworld controlled by a group of beings known as The Strangers who possess the ability to put people to sleep and alter the city and its inhabitants. Now Murdoch must find a way to stop them before they take control of his mind and destroy him.",
        "release_date": "27 Feb 1998",
        "runtime": "100 min",
        "genre": "Fantasy, Mystery, Sci-Fi",
        "director": "Alex Proyas",
        "actors": "Rufus Sewell, Kiefer Sutherland, Jennifer Connelly",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTFhMmE1YzgtNTFhYS00MTRlLWI3ZDMtMWJkMTBmOWMzOTk5XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "Enemy",
        "year": "2013",
        "overview": "Adam Bell is a Toronto area History college professor. He is a rather somber man, largely because he is stuck in a routine, which includes a relationship with his live-in girlfriend, Mary. While watching a rental movie, he spots an actor in a bit part that looks like him. He becomes obsessed with finding out about this double of his. He learns that the actor's stage name is Daniel Saint Claire, whose legal name is Anthony Claire. Claire is a Toronto based actor with only a few on-screen credits, and is married to a woman named Helen who is currently several months pregnant. Adam then becomes obsessed with meeting Claire, who he learns upon first sighting that they look exactly the same, from the facial hair to a scar each has, but Claire who outwardly is more \"put together\" than Adam. Their lives become intertwined as Claire himself ends up becoming obsessed with Adam, but in a slightly different way.",
        "release_date": "06 Feb 2014",
        "runtime": "91 min",
        "genre": "Drama, Mystery, Thriller",
        "director": "Denis Villeneuve",
        "actors": "Jake Gyllenhaal, Mélanie Laurent, Sarah Gadon",
        "rating": "6.9",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTQ2NzA5NjE4N15BMl5BanBnXkFtZTgwMjQ4NzMxMTE@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "Gone Baby Gone",
        "year": "2007",
        "overview": "When 4 year old Amanda McCready disappears from her home and the police make little headway in solving the case, the girl's aunt Beatrice McCready hires two private detectives Patrick Kenzie and Angie Gennaro. The detectives freely admit that they have little experience with this type of case, but the family wants them for two reasons - they're not cops and they know the tough Boston neighborhood in which they all live. As the case progresses, Kenzie and Gennaro face drug dealers, gangs and pedophiles. When they are about to solve their case, they are faced with a moral dilemma that could tear them apart.",
        "release_date": "19 Oct 2007",
        "runtime": "114 min",
        "genre": "Crime, Drama, Mystery",
        "director": "Ben Affleck",
        "actors": "Morgan Freeman, Ed Harris, Casey Affleck",
        "rating": "7.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BOTlmNmU2NDgtZDU1OS00OTFhLWJlNTgtMWE2OGQ1OTg1MGM4XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "Looper",
        "year": "2012",
        "overview": "Joe is classified as a \"looper\", a job in which his employers use time travel to send men from the future to be killed into the past, where Joe can properly dispose of their bodies. However, to tie up loose ends and erase the evidence of his ever being a looper, Joe knows that one day his future self will be sent back for him to kill. When this day comes, Joe's future self is prepared and escapes, and the two men struggle separately in the past trying to evade capture and attempting to fulfill their own personal agendas.",
        "release_date": "28 Sep 2012",
        "runtime": "119 min",
        "genre": "Action, Drama, Sci-Fi",
        "director": "Rian Johnson",
        "actors": "Joseph Gordon-Levitt, Bruce Willis, Emily Blunt",
        "rating": "7.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTg5NTA3NTg4NF5BMl5BanBnXkFtZTcwNTA0NDYzOA@@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "Mulholland Drive",
        "year": "2001",
        "overview": "Still untarnished by the false promises of the rapacious film industry, the wide-eyed actress, Betty, sets foot on bustling, sun-kissed Hollywood. Brimming with hope, and eager to spread her wings and prove her worth, Betty moves in Aunt Ruth's expensive apartment, unbeknownst to her, however, that fate has other plans in store for her, setting the stage for life-altering experiences with the unexpected, the indecipherable, and the unknown. Now, in the centre of an elaborate labyrinth of half-truths, faded memories, unrequited loves, and dangerous encounters with the city's ugly face lies a strange key to a mysterious keyhole, an even stranger indigo-blue cube, the young director, Adam, and one cryptic woman: the amnesiac brunette and devilishly seductive car-crash survivor, Rita. But, time flies and Rita's opaque past demands answers. After all, both women deserve the truth. What is the secret of the serpentine, dream-crushing Mulholland Drive?",
        "release_date": "19 Oct 2001",
        "runtime": "147 min",
        "genre": "Drama, Mystery, Thriller",
        "director": "David Lynch",
        "actors": "Naomi Watts, Laura Harring, Justin Theroux",
        "rating": "7.9",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNjliY2UwMjQtYjVlNi00NzExLTg1MDMtMjE2OTYwYjI0NTcxXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "Predestination",
        "year": "2014",
        "overview": "PREDESTINATION chronicles the life of a Temporal Agent sent on an intricate series of time-travel journeys designed to ensure the continuation of his law enforcement career for all eternity. Now, on his final assignment, the Agent must pursue the one criminal that has eluded him throughout time.",
        "release_date": "09 Jan 2015",
        "runtime": "97 min",
        "genre": "Action, Drama, Sci-Fi",
        "director": "Michael Spierig, Peter Spierig",
        "actors": "Ethan Hawke, Sarah Snook, Noah Taylor",
        "rating": "7.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BY2VhODM5OTUtZDJhMi00MTc5LThjNjYtZWY1M2NlNWU0N2NjXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "Source Code",
        "year": "2011",
        "overview": "Army Captain Colter Stevens finds himself working on a special program where his consciousness can be inserted into another human being. The only catch is can only be there for 8 minutes at any given time. That morning, a bomb exploded on a commuter train just outside Chicago. He occupies the body of teacher going to work on that train and is confused as to what he is doing or why he is there as his last memory is of flying his helicopter on a combat mission in Afghanistan. Those in charge of the program explain to him that there is a bomb on the train, and that he must locate it. More importantly, he must identify the bomber as another bombing is expected later that day. He is also told however that he cannot change the past and can only gather information. As he develops a liking for his traveling companion Christina, he sets out to test that theory.",
        "release_date": "01 Apr 2011",
        "runtime": "93 min",
        "genre": "Action, Drama, Mystery",
        "director": "Duncan Jones",
        "actors": "Jake Gyllenhaal, Michelle Monaghan, Vera Farmiga",
        "rating": "7.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMTY0MTc3MzMzNV5BMl5BanBnXkFtZTcwNDE4MjE0NA@@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "The Game",
        "year": "1997",
        "overview": "Nicholas Van Orton is a very wealthy San Francisco banker, but he is an absolute loner, even spending his birthday alone. In the year of his 48th birthday (the age his father committed suicide) his brother Conrad, who has gone long ago and surrendered to addictions of all kinds, suddenly returns and gives Nicholas a card giving him entry to unusual entertainment provided by something called Consumer Recreation Services (CRS). Giving in to curiosity, Nicholas visits CRS and all kinds of weird and bad things start to happen to him.",
        "release_date": "12 Sep 1997",
        "runtime": "129 min",
        "genre": "Drama, Mystery, Thriller",
        "director": "David Fincher",
        "actors": "Michael Douglas, Deborah Kara Unger, Sean Penn",
        "rating": "7.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNGUzNzQwNmMtNzI3Mi00ZDIwLWJlM2ItMTA5N2Q2ZDMxMjJiXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "The Illusionist",
        "year": "2006",
        "overview": "In late nineteenth century Vienna, renowned illusionist Eisenheim is reunited with the Duchess von Teschen when she is volunteered from the audience to participate in an illusion during one of his performances. Despite having not seen each other in fifteen years when they were teenagers, they almost immediately recognize each other as Eduard Abramovich and Sophie von Teschen, they who had a doomed romance at that time due to their class differences. The Duchess is soon to be wed to the Crown Prince Leopold in what would be for him a marriage solely in pursuit of power: overthrowing his father, the Emperor Leopold, as well as overtaking the Hungarian side of the empire. The Crown Prince is known to use violence against women if it suits his needs or purposes. As such, the Duchess, who realizes that she still loves Eisenheim and he her, can never leave the Crown Prince without it jeopardizing her life. After Eisenheim humiliates the Crown Prince at a private show which results in an incident between the Crown Prince and the Duchess, the battle between Eisenheim and the Crown Prince moves into the public performance realm, which many believe demonstrates Eisenheim's supernatural powers. Much of the work for the Crown Prince in the battle with Eisenheim is conducted by Chief Inspector Uhl, who would become the Chief of Police under the Crown Prince's reign. As such, Uhl may have ulterior motives in turning a blind eye to any unlawful act of the Crown Prince against Eisenheim or the Duchess.",
        "release_date": "01 Sep 2006",
        "runtime": "110 min",
        "genre": "Drama, Fantasy, Mystery",
        "director": "Neil Burger",
        "actors": "Edward Norton, Jessica Biel, Paul Giamatti",
        "rating": "7.5",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BNzNmYmI4YWMtMGFkOS00ODVkLTg3MTEtOTExNDg3ZjQ0MGM3XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "The Matrix",
        "year": "1999",
        "overview": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. As a rebel against the machines, Neo must confront the agents: super-powerful computer programs devoted to stopping Neo and the entire human rebellion.",
        "release_date": "31 Mar 1999",
        "runtime": "136 min",
        "genre": "Action, Sci-Fi",
        "director": "Lana Wachowski, Lilly Wachowski",
        "actors": "Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss",
        "rating": "8.7",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BN2NmN2VhMTQtMDNiOS00NDlhLTliMjgtODE2ZTY0ODQyNDRhXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Nolan - esque - Complex Thriller"
    },
    {
        "title": "Spider-Man 3",
        "year": "2007",
        "overview": "Peter Parker has finally managed to piece together the once-broken parts of his life, maintaining a balance between his relationship with Mary-Jane and his responsibility as Spider-Man. But more challenges arise for our young hero. Peter's old friend Harry Obsourne has set out for revenge against Peter; taking up the mantle of his late father's persona as The New Goblin, and Peter must also capture Uncle Ben's real killer, Flint Marko, who has been transformed into his toughest foe yet, the Sandman. All hope seems lost when suddenly Peter's suit turns jet-black and greatly amplifies his powers. But it also begins to greatly amplify the much darker qualities of Peter's personality that he begins to lose himself to. Peter has to reach deep inside himself to free the compassionate hero he used to be if he is to ever conquer the darkness within and face not only his greatest enemies, but also...himself.",
        "release_date": "04 May 2007",
        "runtime": "139 min",
        "genre": "Action, Adventure, Sci-Fi",
        "director": "Sam Raimi",
        "actors": "Tobey Maguire, Kirsten Dunst, Topher Grace",
        "rating": "6.3",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BODE2NzNhMDctYjUzMC00Y2M5LWI2Y2EtODJkZTFjN2Y5ODlmXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Spider-Verse"
    },
    {
        "title": "Spider-Man: Far from Home",
        "year": "2019",
        "overview": "Our friendly neighborhood Super Hero decides to join his best friends Ned, MJ, and the rest of the gang on a European vacation. However, Peter's plan to leave super heroics behind for a few weeks are quickly scrapped when he begrudgingly agrees to help Nick Fury uncover the mystery of several elemental creature attacks, creating havoc across the continent.",
        "release_date": "02 Jul 2019",
        "runtime": "129 min",
        "genre": "Action, Adventure, Comedy",
        "director": "Jon Watts",
        "actors": "Tom Holland, Samuel L. Jackson, Jake Gyllenhaal",
        "rating": "7.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMzNhNTE0NWQtN2E1Ny00NjcwLTg1YTctMGY1NmMwODJmY2NmXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Spider-Verse"
    },
    {
        "title": "Spider-Man: Homecoming",
        "year": "2017",
        "overview": "A young Peter Parker/Spider-Man begins to navigate his newfound identity as the web-slinging super hero Spider-Man. Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark. Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened.",
        "release_date": "07 Jul 2017",
        "runtime": "133 min",
        "genre": "Action, Adventure, Sci-Fi",
        "director": "Jon Watts",
        "actors": "Tom Holland, Michael Keaton, Robert Downey Jr.",
        "rating": "7.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BODY2MTAzOTQ4M15BMl5BanBnXkFtZTgwNzg5MTE0MjI@._V1_SX300.jpg",
        "category": "Spider-Verse"
    },
    {
        "title": "Spider-Man: No Way Home",
        "year": "2021",
        "overview": "Peter Parker's secret identity is revealed to the entire world. Desperate for help, Peter turns to Doctor Strange to make the world forget that he is Spider-Man. The spell goes horribly wrong and shatters the multiverse, bringing in monstrous villains that could destroy the world.",
        "release_date": "17 Dec 2021",
        "runtime": "148 min",
        "genre": "Action, Adventure, Fantasy",
        "director": "Jon Watts",
        "actors": "Tom Holland, Zendaya, Benedict Cumberbatch",
        "rating": "8.2",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMmFiZGZjMmEtMTA0Ni00MzA2LTljMTYtZGI2MGJmZWYzZTQ2XkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Spider-Verse"
    },
    {
        "title": "Spider-Man",
        "year": "2002",
        "overview": "Based on Marvel Comics' superhero character, this is a story of Peter Parker who is a nerdy high-schooler. He was orphaned as a child, bullied by jocks, and can't confess his crush for his stunning neighborhood girl Mary Jane Watson. To say his life is \"miserable\" is an understatement. But one day while on an excursion to a laboratory a runaway radioactive spider bites him... and his life changes in a way no one could have imagined. Peter acquires a muscle-bound physique, clear vision, ability to cling to surfaces and crawl over walls, shooting webs from his wrist ... but the fun isn't going to last. An eccentric millionaire Norman Osborn administers a performance enhancing drug on himself and his maniacal alter ego Green Goblin emerges. Now Peter Parker has to become Spider-Man and take Green Goblin to the task... or else Goblin will kill him. They come face to face and the war begins in which only one of them will survive at the end.",
        "release_date": "03 May 2002",
        "runtime": "121 min",
        "genre": "Action, Adventure, Sci-Fi",
        "director": "Sam Raimi",
        "actors": "Tobey Maguire, Kirsten Dunst, Willem Dafoe",
        "rating": "7.4",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BZWM0OWVmNTEtNWVkOS00MzgyLTkyMzgtMmE2ZTZiNjY4MmFiXkEyXkFqcGc@._V1_SX300.jpg",
        "category": "Spider-Verse"
    },
    {
        "title": "The Amazing Spider-Man 2",
        "year": "2014",
        "overview": "We've always known that Spider-Man's most important conflict has been within himself: the struggle between the ordinary obligations of Peter Parker and the extraordinary responsibilities of Spider-Man. But in The Amazing Spider-Man 2, Peter Parker finds that his greatest battle is about to begin. It's great to be Spider-Man. For Peter Parker, there's no feeling quite like swinging between skyscrapers, embracing being the hero, and spending time with Gwen. But being Spider-Man comes at a price: only Spider-Man can protect his fellow New Yorkers from the formidable villains that threaten the city. With the emergence of Electro, Peter must confront a foe far more powerful than he. And as his old friend, Harry Osborn, returns, Peter comes to realize that all of his enemies have one thing in common: Oscorp.",
        "release_date": "02 May 2014",
        "runtime": "142 min",
        "genre": "Action, Adventure, Sci-Fi",
        "director": "Marc Webb",
        "actors": "Andrew Garfield, Emma Stone, Jamie Foxx",
        "rating": "6.6",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BOTA5NDYxNTg0OV5BMl5BanBnXkFtZTgwODE5NzU1MTE@._V1_SX300.jpg",
        "category": "Spider-Verse"
    },
    {
        "title": "The Amazing Spider-Man",
        "year": "2012",
        "overview": "Peter Parker (Garfield) is an outcast high schooler who was abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben (Sheen) and Aunt May (Field). Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. Peter is also finding his way with his first high school crush, Gwen Stacy (Stone), and together, they struggle with love, commitment, and secrets. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance - leading him directly to Oscorp and the lab of Dr. Curt Connors (Ifans), his father's former partner. As Spider-Man is set on a collision course with Connors' alter-ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.",
        "release_date": "03 Jul 2012",
        "runtime": "136 min",
        "genre": "Action, Sci-Fi",
        "director": "Marc Webb",
        "actors": "Andrew Garfield, Emma Stone, Rhys Ifans",
        "rating": "6.9",
        "poster_path": "https://m.media-amazon.com/images/M/MV5BMjMyOTM4MDMxNV5BMl5BanBnXkFtZTcwNjIyNzExOA@@._V1_SX300.jpg",
        "category": "Spider-Verse"
    }
]